data = ["0 0.391016 0.570139 0.025781 0.029167\n",
        "0 0.415234 0.561111 0.028906 0.033333\n",
        "0 0.480469 0.562500 0.026562 0.038889\n",
        "0 0.505078 0.559722 0.025781 0.036111\n",
        "0 0.527344 0.561111 0.028125 0.033333\n",
        "0 0.597266 0.559028 0.033594 0.034722\n",
        "0 0.643750 0.552083 0.032813 0.037500\n",
        "0 0.672266 0.552083 0.032031 0.034722\n",
        "1 0.710156 0.545833 0.029687 0.044444\n"]

for i in range(2, 203):
    fname = str(i) + ".txt"
    
    with open(fname, "a") as f:
        for d in data:
            f.write(d)
    """
    with open(fname, "r") as f:
        lines = f.readlines()
    with open(fname, "w") as f:
        for line in lines:
            if line.strip("\n") not in data:     # <= 이 문자열만 골라서 삭제
                f.write(line)
    """

